tutorials/simpleRemediation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       31720;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       31800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          32000;
        startFace       31880;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       63880;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       64080;
    }
)

// ************************************************************************* //
