tutorials/simpleRemediation/constant/multiRateProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      multiRateProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberExp 2;
nOfSC	1;

immobileRegions
(
    Sphere1
    {
        type                            Spheres;
        numberOfTermsInExpansion     $numberExp;
    	numberOfSubTimeSteps	         $nOfSC;
    	//debug;
    }

    Sphere2
    {
        type                            Spheres;
        numberOfTermsInExpansion     $numberExp;
    	numberOfSubTimeSteps	         $nOfSC;
    }

    Sphere3
    {
        type                            Spheres;
        numberOfTermsInExpansion     $numberExp;
    	numberOfSubTimeSteps	         $nOfSC;
    }

    Layer1
    {
        type                            Layers;
        numberOfTermsInExpansion     $numberExp;
    	numberOfSubTimeSteps	         $nOfSC;
    }
);
