tutorials/simpleRemediation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Dc              Dc [0 2 -1 0 0 0 0] 2.8e-07;
beta            beta [0 0 0 0 0 0 0] 0.05;
mu              mu [1 -1 -1 0 0 0 0] 8.9e-04;
rho             rho [1 -3 0 0 0 0 0] 1000;

// ************************************************************************* //
