tutorials/simpleRemediation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1.5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16000
(
(0.00100017 -1.70692e-07 0)
(0.00100056 -2.15823e-07 0)
(0.00100108 -3.02912e-07 0)
(0.0010018 -4.24212e-07 0)
(0.00100279 -5.64719e-07 0)
(0.00100406 -6.98786e-07 0)
(0.00100554 -7.85026e-07 0)
(0.00100709 -7.62921e-07 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.001 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    left
    {
        type            noSlip;
    }
    right
    {
        type            noSlip;
    }
}


// ************************************************************************* //
