tutorials/simpleRemediation/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1.5";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16000
(
2.07782e+07
2.07239e+07
2.06696e+07
2.06153e+07
2.05609e+07
2.05064e+07
2.04519e+07
2.03973e+07
...
)
;

boundaryField
{
    inlet
    {
        type            darcyGradPressureAniso;
        gradient        nonuniform List<scalar> 
80
(
1.08539e+07
1.08539e+07
1.08539e+07
1.08539e+07
1.08539e+07
1.08539e+07
1.08539e+07
1.08539e+07
...
)
;
        value           nonuniform List<scalar> 
80
(
2.08053e+07
2.08053e+07
2.08054e+07
2.08054e+07
2.08054e+07
2.08054e+07
2.08053e+07
2.08052e+07
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    left
    {
        type            darcyGradPressureAniso;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
200
(
2.07782e+07
2.07239e+07
2.06696e+07
2.06153e+07
2.05609e+07
2.05064e+07
2.04519e+07
2.03973e+07
...
)
;
    }
    right
    {
        type            darcyGradPressureAniso;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
200
(
2.14088e+07
2.13595e+07
2.131e+07
2.12604e+07
2.12105e+07
2.11605e+07
2.11102e+07
2.10595e+07
...
)
;
    }
}


// ************************************************************************* //
