tutorials/simpleRemediation/0/beta.Sphere3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      beta.Sphere3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16000
(
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.093453
0.093453
0.093453
0.093453
0.093453
0.093453
0.093453
0.093453
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
0.201045
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.036799
0.036799
0.036799
0.036799
0.036799
0.036799
0.036799
0.036799
...
)
;
    }
}


// ************************************************************************* //
