tutorials/simpleRemediation/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "1.5";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
31720
(
5.00171e-06
-1.70692e-09
5.00386e-06
-2.15823e-09
5.00689e-06
-3.02912e-09
5.01114e-06
-4.24212e-09
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-5e-06
-5e-06
-5e-06
-5e-06
-5e-06
-5e-06
-5e-06
-5e-06
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
4.04581e-06
4.08218e-06
4.15377e-06
4.25821e-06
4.39175e-06
4.54915e-06
4.72373e-06
4.90764e-06
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    left
    {
        type            calculated;
        value           uniform 0;
    }
    right
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
