tutorials/simpleRemediation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    ".*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           1e-04;
    }
}


SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p               1e-8;
    }
}

relaxationFactors
{
    fields
    {
        p     1;
    }

    equations
    {
        p   1;
    }
}

cache
{
    grad(p);
}



PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors 15;

    outerCorrectorResidualControl
    {
        c
		{
	   		tolerance  1e-05;
	   		relTol     0;
		}
    }

}


// ************************************************************************* //
