tutorials/simpleRemediation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue beta 0.2
    volScalarFieldValue beta.Sphere1 1
    volScalarFieldValue beta.Sphere2 1
    volScalarFieldValue beta.Sphere3 1
    volScalarFieldValue beta.Layer1 1
    volTensorFieldValue K (0 0 0 0 0 0 0 0 0)
);

regions
(
    #include "../octave/regions"
);


// ************************************************************************* //
